{
  "semanas": [
    {
      "titulo": "fisrt week",
      "conteudo": "As I mentioned in my bio, I started my career in a telemarketing job. After almost a year, I got a call from my old boss who asked me, 'Do you like IT?'. That moment sparked my transition into technology."
    },
    {
      "titulo": "Second Week",
      "conteudo": "I'm always looking to improve, as you may have seen, I always like to learn and discover new things, so I set up this project where I will talk about everything I learned during a week.."
    },
     {
      "titulo": "Third Week",
      "conteudo": Recently, I developed a landing page in JavaScript as a way to refresh and strengthen my skills in the area. The idea came from observing a recurring need faced by a local company I’m closely connected with — they offer courses and operate in the solar energy sector but struggle to acquire qualified leads for their sales.
With that in mind, I created a website with a simple, direct, and efficient proposal: to attract potential clients by clearly presenting the benefits of solar energy, with a strong focus on financial savings. The first message visitors see is: Do you want to know how to save money every month? From there, the site explains how solar energy works, the average savings a person can expect, and the positive impact both on their finances and the environment.
At the end of the page, users are invited to fill out a form with their name, phone number, and email. This information is then used by a specialized sales representative from the company to get in touch and offer personalized assistance — whether to answer questions or finalize a sale.
Additionally, I envisioned a low-cost, high-reach marketing strategy: installing interactive totems in target cities where the company wants to expand. These totems would display the website and could be placed in strategic locations — such as local businesses or even in the stores of satisfied customers. This approach would not only increase the company's reach without requiring a mobile sales team but also build greater credibility by involving the local community in the promotion effort.
The goal of this project is to provide a practical and scalable solution to boost sales, improve lead generation, and strengthen the company’s presence in the regional market — using technology and collaboration with local partners as the foundation for this transformation.
Key Features:
Clean, modern design with colorful visual identity
 Educational sections explaining how solar power works
 Accordion-style FAQs to improve user experience
 Highlighted savings and benefits of adopting solar energy
 Functional contact form to collect name, email, and phone number
 Fully responsive layout for mobile and desktop
 Hosted with GitHub Pages
________________________________________
 Image Suggestions for Post:
 Screenshot of the header with the Octopus mascot
Screenshot of the “Why Choose Octopus?” feature cards
 Screenshot of the contact form filled out
 Include a link to the live site!
________________________________________
 View the live site:
 https://eduardo-bidoja.github.io/octopus-solar
 GitHub repo: github.com/Eduardo-bidoja/octopus -solar
________________________________________
 Built with:
•	HTML5 + CSS3
•	JavaScript (accordion + validation)
•	GitHub Pages for hosting
•	VS Code for development
•	Mobile-first responsive layout
________________________________________
 Ideal for:
•	Sales professionals in the solar industry
•	Marketing teams or business owners
•	Anyone looking to generate leads with a branded website
I can adapt this site to fit any brand or business. Let’s connect!
________________________________________
 If you like this project:
 Leave a comment
 Share it with your network
 Follow for more web projects
    },
  ]
}
